ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/shell_commands.c
/*
 * shell_commands.c - Command Table Based Shell
 */

#include "shell_commands.h"
#include <errno.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <zephyr/kernel.h>
#include <pico/bootrom.h>

#include "catsniffer.h"
#include "cc1352_jtag.h"
#include "fw_metadata.h"

// External functions from main.c
void shell_reply(const char *msg);
void change_mode(unsigned long new_mode);
void change_band(unsigned long new_band);
void process_lora_command(char *cmd_line);
int queue_radio_command(const char *cmd_line);
void set_status_leds(int l0, int l1, int l2);

extern catsniffer_t catsniffer;

// Command handler type
typedef void (*cmd_handler_t)(char *args);

// Command table entry
typedef struct {
	const char *name;
	cmd_handler_t handler;
	const char *help;
	bool prefix_match; // true for commands with args (TX, TEST)
} shell_cmd_t;

// Forward declarations
static void cmd_help(char *args);
static void cmd_boot(char *args);
static void cmd_exit(char *args);
static void cmd_band1(char *args);
static void cmd_band2(char *args);
static void cmd_band3(char *args);
static void cmd_reboot(char *args);
static void cmd_status(char *args);
static void cmd_fw_version(char *args);
static void cmd_lora_freq(char *args);
static void cmd_lora_sf(char *args);
static void cmd_lora_bw(char *args);
static void cmd_lora_cr(char *args);
static void cmd_lora_power(char *args);
static void cmd_lora_mode(char *args);
static void cmd_lora_preamble(char *args);
static void cmd_lora_syncword(char *args);
static void cmd_lora_iq(char *args);
static void cmd_lora_config(char *args);
static void cmd_lora_apply(char *args);
static void cmd_cc1352_fw_id(char *args);
static void cmd_fsk_freq(char *args);
static void cmd_fsk_bitrate(char *args);
static void cmd_fsk_fdev(char *args);
static void cmd_fsk_bw(char *args);
static void cmd_fsk_power(char *args);
static void cmd_fsk_preamble(char *args);
static void cmd_fsk_syncword(char *args);
static void cmd_fsk_crc(char *args);
static void cmd_fsk_whitening(char *args);
static void cmd_fsk_pktlen(char *args);
static void cmd_fsk_payload(char *args);
static void cmd_fsk_bt(char *args);
static void cmd_fsk_config(char *args);
static void cmd_fsk_apply(char *args);
static void cmd_modulation(char *args);
static void cmd_radio(char *args);
static void cmd_cc1352_jtag(char *args);

static const char *fsk_bw_reg_to_khz_str(uint8_t bw_reg)
{
	switch (bw_reg) {
	case 0x1F:
		return "4.8";
	case 0x17:
		return "5.8";
	case 0x0F:
		return "7.3";
	case 0x1E:
		return "9.7";
	case 0x16:
		return "11.7";
	case 0x0E:
		return "14.6";
	case 0x1D:
		return "19.5";
	case 0x15:
		return "23.4";
	case 0x0D:
		return "29.3";
	case 0x1C:
		return "39.0";
	case 0x14:
		return "46.9";
	case 0x0C:
		return "58.6";
	case 0x1B:
		return "78.2";
	case 0x13:
		return "93.8";
	case 0x0B:
		return "117.3";
	case 0x1A:
		return "156.2";
	case 0x12:
		return "187.2";
	case 0x0A:
		return "234.3";
	case 0x19:
		return "312.0";
	case 0x11:
		return "373.6";
	case 0x09:
		return "467.0";
	default:
		return "unknown";
	}
}

// Command table
static const shell_cmd_t commands[] = {
	{ "help", cmd_help, "Show available commands", false },
	{ "boot", cmd_boot, "CC1352 bootloader mode", false },
	{ "exit", cmd_exit, "Return to passthrough", false },
	{ "band1", cmd_band1, "2.4GHz band", false },
	{ "band2", cmd_band2, "SUB-GHz band", false },
	{ "band3", cmd_band3, "LoRa band", false },
	{ "reboot", cmd_reboot, "RP2040 USB bootloader", false },
	{ "status", cmd_status, "Device status", false },
	{ "fw_version", cmd_fw_version, "Show firmware build version", false },
	{ "lora_freq", cmd_lora_freq, "Set frequency (Hz)", true },
	{ "lora_sf", cmd_lora_sf, "Set spreading factor", true },
	{ "lora_bw", cmd_lora_bw, "Set bandwidth (kHz)", true },
	{ "lora_cr", cmd_lora_cr, "Set coding rate", true },
	{ "lora_power", cmd_lora_power, "Set TX power (dBm)", true },
	{ "lora_mode", cmd_lora_mode, "stream|command mode", true },
	{ "lora_preamble", cmd_lora_preamble, "Set preamble length", true },
	{ "lora_syncword", cmd_lora_syncword, "private|public network", true },
	{ "lora_iq", cmd_lora_iq, "normal|inverted IQ", true },
	{ "lora_config", cmd_lora_config, "Show LoRa config", false },
	{ "lora_apply", cmd_lora_apply, "Apply pending config", false },
	{ "cc1352_fw_id", cmd_cc1352_fw_id, "set|get|clear|list CC1352 FW ID",
	  true },
	/* FSK/GFSK Commands */
	{ "fsk_freq", cmd_fsk_freq, "Set FSK frequency (Hz)", true },
	{ "fsk_bitrate", cmd_fsk_bitrate, "Set FSK bitrate (bps)", true },
	{ "fsk_fdev", cmd_fsk_fdev, "Set FSK freq deviation (Hz)", true },
	{ "fsk_bw", cmd_fsk_bw, "Set FSK RX bandwidth", true },
	{ "fsk_power", cmd_fsk_power, "Set FSK TX power (dBm)", true },
	{ "fsk_preamble", cmd_fsk_preamble, "Set FSK preamble len", true },
	{ "fsk_syncword", cmd_fsk_syncword, "Set FSK sync word (hex)", true },
	{ "fsk_crc", cmd_fsk_crc, "Enable/disable CRC", true },
	{ "fsk_whitening", cmd_fsk_whitening, "Enable/disable whitening",
	  true },
	{ "fsk_pktlen", cmd_fsk_pktlen, "fixed|variable packet length", true },
	{ "fsk_payload", cmd_fsk_payload, "Set payload/max len (1-255)", true },
	{ "fsk_bt", cmd_fsk_bt, "Set GFSK BT (off|0.3|0.5|0.7|1.0)", true },
	{ "fsk_config", cmd_fsk_config, "Show FSK config", false },
	{ "fsk_apply", cmd_fsk_apply, "Apply FSK config", false },
	{ "modulation", cmd_modulation, "lora|fsk modulation", true },
		{ "radio", cmd_radio, "Forward radio cmd (TEST/FSKRX/FSKTX/TX)", true },
		{ "cc1352_jtag", cmd_cc1352_jtag, "init|id|halt|status|diag", true },
		{ NULL, NULL, NULL, false }
};

// Command implementations
static void cmd_help(char *args)
{
	shell_reply("Commands:\r\n");
	for (const shell_cmd_t *cmd = commands; cmd->name != NULL; cmd++) {
		char buf[80];
		snprintf(buf, sizeof(buf), "  %-14s - %s\r\n", cmd->name,
			 cmd->help);
		shell_reply(buf);
	}
	shell_reply("\r\nFSK bandwidths (kHz):\r\n");
	shell_reply("  4.8, 5.8, 7.3, 9.7, 11.7, 14.6, 19.5, 23.4,\r\n");
	shell_reply("  29.3, 39.0, 46.9, 58.6, 78.2, 93.8, 117.3,\r\n");
	shell_reply("  156.2, 187.2, 234.3, 312.0, 373.6, 467.0\r\n");
}

