ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/shell_commands.c
static void cmd_boot(char *args)
{
	change_mode(BOOT);
	set_status_leds(0, 0, catsniffer.mode);
	shell_reply("BOOT\r\n");
}

static void cmd_exit(char *args)
{
	change_mode(PASSTHROUGH);
	set_status_leds(0, 0, 0);
	shell_reply("PASSTHROUGH\r\n");
}

static void cmd_band1(char *args)
{
	change_band(GIG);
	set_status_leds(0, 0, 0);
	shell_reply("2.4GHz Band\r\n");
}

static void cmd_band2(char *args)
{
	change_band(SUBGIG_1);
	set_status_leds(0, 0, 0);
	shell_reply("SUB-GHz Band\r\n");
}

static void cmd_band3(char *args)
{
	change_band(SUBGIG_2);
	set_status_leds(0, 0, 0);
	shell_reply("LoRa Band\r\n");
}

static void cmd_reboot(char *args)
{
	shell_reply("Entering USB bootloader...\r\n");
	k_msleep(100);
	reset_usb_boot(0, 0);
}

static void cmd_status(char *args)
{
	char buf[320];
	const char *mode_str = (catsniffer.lora_mode == LORA_MODE_STREAM) ?
				       "Stream" :
				       "Command";
	const char *lora_status =
		catsniffer.lora_initialized ? "initialized" : "not initialized";
	char fw_id[CC1352_FW_ID_MAX_LEN];
	const char *fw_id_str = "unset";
	const char *fw_type = "n/a";
	if (fw_metadata_get_cc1352_fw_id(fw_id, sizeof(fw_id)) == 0) {
		fw_id_str = fw_id;
		fw_type = fw_metadata_is_official_cc1352_fw_id(fw_id) ? "offici"
									"al" :
									"custo"
									"m";
	}
	snprintf(buf, sizeof(buf),
		 "Mode: %d, Band: %d, Radio: %s, LoRa: %s, LoRa Mode: %s, FW: "
		 "%s, "
		 "CC1352 FW: %s (%s)\r\n",
		 catsniffer.mode, catsniffer.band,
		 catsniffer.current_modulation == FSK_MOD_FSK ? "FSK" : "LoRa",
		 lora_status, mode_str, CATSNIFFER_FW_VERSION, fw_id_str,
		 fw_type);
	shell_reply(buf);
}

static void cmd_fw_version(char *args)
{
	char buf[320];
	snprintf(buf, sizeof(buf),
		 "FW: %s\r\nGit: %s (%s)\r\nBuilt: %s\r\nCompiler: %s %s\r\n",
		 CATSNIFFER_FW_VERSION, CATSNIFFER_GIT_SHA,
		 CATSNIFFER_GIT_DIRTY, CATSNIFFER_BUILD_TIME_UTC,
		 CATSNIFFER_COMPILER_ID, CATSNIFFER_COMPILER_VERSION);
	shell_reply(buf);
}

static void cmd_cc1352_fw_id(char *args)
{
	char *subcmd;
	char *value;

	while (*args && *args != ' ') {
		args++;
	}
	while (*args == ' ') {
		args++;
	}

	subcmd = args;
	while (*args && *args != ' ') {
		args++;
	}
	if (*args != '\0') {
		*args++ = '\0';
	}
	while (*args == ' ') {
		args++;
	}
	value = args;

	if (subcmd[0] == '\0') {
		shell_reply("Usage: cc1352_fw_id <set|get|clear|list> "
			    "[id]\r\n");
		return;
	}

	if (strcmp(subcmd, "set") == 0) {
		char msg[128];
		const char *type;
		int ret;

		if (value[0] == '\0') {
			shell_reply("Usage: cc1352_fw_id set <id>\r\n");
			return;
		}

		ret = fw_metadata_set_cc1352_fw_id(value);
		if (ret < 0) {
			if (ret == -EINVAL) {
				shell_reply("ERR invalid ID (allowed: a-z A-Z "
					    "0-9 _ - . , max 31)\r\n");
			} else {
				shell_reply("ERR storage unavailable\r\n");
			}
			return;
		}

		type = fw_metadata_is_official_cc1352_fw_id(value) ? "officia"
								     "l" :
								     "custom";
		snprintf(msg, sizeof(msg), "OK cc1352_fw_id=%s (%s)\r\n", value,
			 type);
		shell_reply(msg);
		return;
	}

	if (strcmp(subcmd, "get") == 0) {
		char fw_id[CC1352_FW_ID_MAX_LEN];
		char msg[128];
		int ret = fw_metadata_get_cc1352_fw_id(fw_id, sizeof(fw_id));
		if (ret == -ENOENT) {
			shell_reply("OK cc1352_fw_id=unset\r\n");
			return;
		}
		if (ret < 0) {
			shell_reply("ERR storage unavailable\r\n");
			return;
		}

		snprintf(msg, sizeof(msg), "OK cc1352_fw_id=%s type=%s\r\n",
			 fw_id,
			 fw_metadata_is_official_cc1352_fw_id(fw_id) ? "officia"
								       "l" :
								       "custo"
								       "m");
		shell_reply(msg);
		return;
	}

	if (strcmp(subcmd, "clear") == 0) {
		int ret = fw_metadata_clear_cc1352_fw_id();
		if (ret < 0) {
			shell_reply("ERR storage unavailable\r\n");
			return;
		}
		shell_reply("OK cc1352_fw_id cleared\r\n");
		return;
	}

	if (strcmp(subcmd, "list") == 0) {
		char msg[96];
		size_t count = fw_metadata_official_id_count();
		shell_reply("Official CC1352 FW IDs:\r\n");
		for (size_t i = 0; i < count; i++) {
			const char *id = fw_metadata_official_id_by_index(i);
			snprintf(msg, sizeof(msg), "  - %s\r\n", id);
			shell_reply(msg);
		}
		return;
	}

	shell_reply("Usage: cc1352_fw_id <set|get|clear|list> [id]\r\n");
}

static void cmd_lora_freq(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_freq <Hz>\r\n");
		return;
	}

	uint32_t freq = (uint32_t)atoi(args);
	if (freq < 137000000 || freq > 1020000000) {
		shell_reply("Error: Frequency must be 137-1020 MHz\r\n");
		return;
	}

	catsniffer.lora_config.frequency = freq;
	catsniffer.lora_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "Frequency set to %u Hz (pending)\r\n",
		 freq);
	shell_reply(buf);
}

static void cmd_lora_sf(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_sf <7-12>\r\n");
		return;
	}

	int sf = atoi(args);
	if (sf < 7 || sf > 12) {
		shell_reply("Error: Spreading factor must be 7-12\r\n");
		return;
	}

	// Map to Zephyr enum values (SF_7, SF_8, ..., SF_12)
	catsniffer.lora_config.spreading_factor = (uint8_t)sf;
	catsniffer.lora_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "Spreading Factor set to SF%d (pending)\r\n",
		 sf);
	shell_reply(buf);
}

static void cmd_lora_bw(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_bw <125|250|500>\r\n");
		return;
	}

	int bw = atoi(args);
	enum lora_signal_bandwidth bw_enum;

	switch (bw) {
	case 125:
		bw_enum = BW_125_KHZ;
		break;
	case 250:
		bw_enum = BW_250_KHZ;
		break;
	case 500:
		bw_enum = BW_500_KHZ;
		break;
	default:
		shell_reply("Error: Bandwidth must be 125, 250, or 500 "
			    "kHz\r\n");
		return;
	}

	catsniffer.lora_config.bandwidth = bw_enum;
	catsniffer.lora_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "Bandwidth set to %d kHz (pending)\r\n", bw);
	shell_reply(buf);
}

static void cmd_lora_cr(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_cr <5|6|7|8>\r\n");
		return;
	}

	int cr = atoi(args);
	uint8_t cr_enum;

	switch (cr) {
	case 5:
		cr_enum = CR_4_5;
		break;
	case 6:
		cr_enum = CR_4_6;
		break;
	case 7:
		cr_enum = CR_4_7;
		break;
	case 8:
		cr_enum = CR_4_8;
		break;
	default:
		shell_reply("Error: Coding rate must be 5, 6, 7, or 8 (for "
			    "4/5, 4/6, 4/7, 4/8)\r\n");
		return;
	}

	catsniffer.lora_config.coding_rate = cr_enum;
	catsniffer.lora_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "Coding Rate set to 4/%d (pending)\r\n", cr);
	shell_reply(buf);
}

static void cmd_lora_power(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_power <-9 to 22>\r\n");
		return;
	}

