ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/shell_commands.c
	int power = atoi(args);
	if (power < -9 || power > 22) {
		shell_reply("Error: TX power must be -9 to 22 dBm\r\n");
		return;
	}

	catsniffer.lora_config.tx_power = (int8_t)power;
	catsniffer.lora_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "TX Power set to %d dBm (pending)\r\n",
		 power);
	shell_reply(buf);
}

static void cmd_lora_mode(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_mode <stream|command>\r\n");
		return;
	}

	if (strncmp(args, "stream", 6) == 0) {
		catsniffer.lora_mode = LORA_MODE_STREAM;
		catsniffer.led_interval = 1000; // Slow blink for stream mode
		shell_reply("LoRa mode set to STREAM (slow blink)\r\n");
	} else if (strncmp(args, "command", 7) == 0) {
		catsniffer.lora_mode = LORA_MODE_COMMAND;
		catsniffer.led_interval = 200; // Fast blink for command mode
		shell_reply("LoRa mode set to COMMAND (fast blink)\r\n");
	} else {
		shell_reply("Error: Mode must be 'stream' or 'command'\r\n");
	}
}

static void cmd_lora_preamble(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_preamble <6-65535>\r\n");
		return;
	}

	int preamble = atoi(args);
	if (preamble < 6 || preamble > 65535) {
		shell_reply("Error: Preamble length must be 6-65535\r\n");
		return;
	}

	catsniffer.lora_config.preamble_len = (uint16_t)preamble;
	catsniffer.lora_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "Preamble length set to %d (pending)\r\n",
		 preamble);
	shell_reply(buf);
}

static void cmd_lora_syncword(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_syncword <private|public>\r\n");
		return;
	}

	if (strncmp(args, "private", 7) == 0) {
		catsniffer.lora_config.public_network = false;
		catsniffer.lora_config.config_pending = true;
		shell_reply("Sync word set to PRIVATE (0x12) (pending)\r\n");
	} else if (strncmp(args, "public", 6) == 0) {
		catsniffer.lora_config.public_network = true;
		catsniffer.lora_config.config_pending = true;
		shell_reply("Sync word set to PUBLIC (0x34) (pending)\r\n");
	} else {
		shell_reply("Error: Must be 'private' or 'public'\r\n");
	}
}

static void cmd_lora_iq(char *args)
{
	// Skip command name to get argument
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: lora_iq <normal|inverted>\r\n");
		return;
	}

	if (strncmp(args, "normal", 6) == 0) {
		catsniffer.lora_config.iq_inverted = false;
		catsniffer.lora_config.config_pending = true;
		shell_reply("IQ set to NORMAL (pending)\r\n");
	} else if (strncmp(args, "inverted", 8) == 0) {
		catsniffer.lora_config.iq_inverted = true;
		catsniffer.lora_config.config_pending = true;
		shell_reply("IQ set to INVERTED (pending)\r\n");
	} else {
		shell_reply("Error: Must be 'normal' or 'inverted'\r\n");
	}
}

static void cmd_lora_config(char *args)
{
	char buf[512];
	const char *mode_str = (catsniffer.lora_mode == LORA_MODE_STREAM) ?
				       "Stream" :
				       "Command";
	const char *pending_str =
		catsniffer.lora_config.config_pending ? " (pending apply)" : "";
	const char *iq_str = catsniffer.lora_config.iq_inverted ? "Inverted" :
								  "Normal";
	const char *syncword_str = catsniffer.lora_config.public_network ?
					   "Public (0x34)" :
					   "Private (0x12)";

	snprintf(buf, sizeof(buf),
		 "LoRa Configuration:%s\r\n"
		 "  Frequency: %u Hz\r\n"
		 "  Spreading Factor: SF%d\r\n"
		 "  Bandwidth: %s kHz\r\n"
		 "  Coding Rate: 4/%d\r\n"
		 "  TX Power: %d dBm\r\n"
		 "  Preamble Length: %d\r\n"
		 "  IQ: %s\r\n"
		 "  Sync Word: %s\r\n"
		 "  Mode: %s\r\n",
		 pending_str, catsniffer.lora_config.frequency,
		 catsniffer.lora_config.spreading_factor,
		 (catsniffer.lora_config.bandwidth == BW_125_KHZ) ? "125" :
		 (catsniffer.lora_config.bandwidth == BW_250_KHZ) ? "250" :
								    "500",
		 (catsniffer.lora_config.coding_rate == CR_4_5) ? 5 :
		 (catsniffer.lora_config.coding_rate == CR_4_6) ? 6 :
		 (catsniffer.lora_config.coding_rate == CR_4_7) ? 7 :
								  8,
		 catsniffer.lora_config.tx_power,
		 catsniffer.lora_config.preamble_len, iq_str, syncword_str,
		 mode_str);
	shell_reply(buf);
}

static void cmd_lora_apply(char *args)
{
	if (!catsniffer.lora_config.config_pending) {
		shell_reply("No pending configuration changes\r\n");
		return;
	}

	int ret = apply_lora_config();
	if (ret < 0) {
		char buf[64];
		snprintf(buf, sizeof(buf),
			 "Error applying configuration: %d\r\n", ret);
		shell_reply(buf);
	} else {
		catsniffer.lora_config.config_pending = false;
		shell_reply("LoRa configuration applied successfully\r\n");
	}
}

/* ============================================ */
/* FSK/GFSK Command Handlers                    */
/* ============================================ */

static void cmd_fsk_freq(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_freq <Hz>\r\n");
		return;
	}

	uint32_t freq = (uint32_t)atoi(args);
	if (freq < 137000000 || freq > 1020000000) {
		shell_reply("Error: Frequency must be 137-1020 MHz\r\n");
		return;
	}

	catsniffer.fsk_config.frequency = freq;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "FSK Frequency set to %u Hz (pending)\r\n",
		 freq);
	shell_reply(buf);
}

static void cmd_fsk_bitrate(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_bitrate <bps>\r\n");
		return;
	}

	uint32_t bitrate = (uint32_t)atoi(args);
	if (bitrate < 600 || bitrate > 300000) {
		shell_reply("Error: Bitrate must be 600-300000 bps\r\n");
		return;
	}

	catsniffer.fsk_config.bitrate = bitrate;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "FSK Bitrate set to %u bps (pending)\r\n",
		 bitrate);
	shell_reply(buf);
}

static void cmd_fsk_fdev(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_fdev <Hz>\r\n");
		return;
	}

	uint32_t fdev = (uint32_t)atoi(args);
	if (fdev < 600 || fdev > 200000) {
		shell_reply("Error: Freq deviation must be 600-200000 Hz\r\n");
		return;
	}

