ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/shell_commands.c
	catsniffer.fsk_config.fdev = fdev;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf),
		 "FSK Freq deviation set to %u Hz (pending)\r\n", fdev);
	shell_reply(buf);
}

static void cmd_fsk_bw(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_bw <bandwidth>\r\n");
		shell_reply("  4.8, 5.8, 7.3, 9.7, 11.7, 14.6, 19.5, "
			    "23.4,\r\n");
		shell_reply("  29.3, 39.0, 46.9, 58.6, 78.2, 93.8, 117.3,\r\n");
		shell_reply("  156.2, 187.2, 234.3, 312.0, 373.6, 467.0 "
			    "kHz\r\n");
		return;
	}

	/* Map common bandwidths to register values */
	uint8_t bw_reg;
	float bw_khz = atof(args);

	/* Use predefined constants from sx126x_regs.h */
	if (bw_khz <= 5)
		bw_reg = 0x1F; /* 4.8 kHz */
	else if (bw_khz <= 6)
		bw_reg = 0x17; /* 5.8 kHz */
	else if (bw_khz <= 8)
		bw_reg = 0x0F; /* 7.3 kHz */
	else if (bw_khz <= 10)
		bw_reg = 0x1E; /* 9.7 kHz */
	else if (bw_khz <= 12)
		bw_reg = 0x16; /* 11.7 kHz */
	else if (bw_khz <= 15)
		bw_reg = 0x0E; /* 14.6 kHz */
	else if (bw_khz <= 20)
		bw_reg = 0x1D; /* 19.5 kHz */
	else if (bw_khz <= 24)
		bw_reg = 0x15; /* 23.4 kHz */
	else if (bw_khz <= 30)
		bw_reg = 0x0D; /* 29.3 kHz */
	else if (bw_khz <= 40)
		bw_reg = 0x1C; /* 39.0 kHz */
	else if (bw_khz <= 50)
		bw_reg = 0x14; /* 46.9 kHz */
	else if (bw_khz <= 60)
		bw_reg = 0x0C; /* 58.6 kHz */
	else if (bw_khz <= 80)
		bw_reg = 0x1B; /* 78.2 kHz */
	else if (bw_khz <= 100)
		bw_reg = 0x13; /* 93.8 kHz */
	else if (bw_khz <= 120)
		bw_reg = 0x0B; /* 117.3 kHz */
	else if (bw_khz <= 160)
		bw_reg = 0x1A; /* 156.2 kHz */
	else if (bw_khz <= 190)
		bw_reg = 0x12; /* 187.2 kHz */
	else if (bw_khz <= 240)
		bw_reg = 0x0A; /* 234.3 kHz */
	else if (bw_khz <= 320)
		bw_reg = 0x19; /* 312.0 kHz */
	else if (bw_khz <= 380)
		bw_reg = 0x11; /* 373.6 kHz */
	else
		bw_reg = 0x09; /* 467.0 kHz */

	catsniffer.fsk_config.bandwidth = bw_reg;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf),
		 "FSK RX bandwidth set (reg=0x%02x) (pending)\r\n", bw_reg);
	shell_reply(buf);
}

static void cmd_fsk_power(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_power <-9 to 22>\r\n");
		return;
	}

	int power = atoi(args);
	if (power < -9 || power > 22) {
		shell_reply("Error: TX power must be -9 to 22 dBm\r\n");
		return;
	}

	catsniffer.fsk_config.tx_power = (int8_t)power;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "FSK TX Power set to %d dBm (pending)\r\n",
		 power);
	shell_reply(buf);
}

static void cmd_fsk_preamble(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_preamble <bytes>\r\n");
		return;
	}

	int preamble = atoi(args);
	if (preamble < 0 || preamble > 65535) {
		shell_reply("Error: Preamble must be 0-65535 bytes\r\n");
		return;
	}

	catsniffer.fsk_config.preamble_len = (uint16_t)preamble;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "FSK Preamble set to %d bytes (pending)\r\n",
		 preamble);
	shell_reply(buf);
}

static void cmd_fsk_syncword(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_syncword <hex_bytes>\r\n");
		shell_reply("  Example: fsk_syncword 12AD\r\n");
		return;
	}

	/* Parse hex string to bytes */
	uint8_t sync_word[8] = { 0 };
	uint8_t len = 0;
	char *ptr = args;

	while (*ptr && len < 8) {
		uint8_t byte = 0;
		for (int i = 0; i < 2 && *ptr; i++) {
			byte <<= 4;
			if (*ptr >= '0' && *ptr <= '9')
				byte |= (*ptr - '0');
			else if (*ptr >= 'A' && *ptr <= 'F')
				byte |= (*ptr - 'A' + 10);
			else if (*ptr >= 'a' && *ptr <= 'f')
				byte |= (*ptr - 'a' + 10);
			else
				break;
			ptr++;
		}
		sync_word[len++] = byte;
	}

	if (len == 0) {
		shell_reply("Error: Invalid hex sync word\r\n");
		return;
	}

	memcpy(catsniffer.fsk_config.sync_word, sync_word, len);
	catsniffer.fsk_config.sync_word_len = len;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf),
		 "FSK Sync word set to %d bytes (pending)\r\n", len);
	shell_reply(buf);
}

static void cmd_fsk_crc(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_crc <on|off>\r\n");
		return;
	}

	if (strncmp(args, "on", 2) == 0) {
		catsniffer.fsk_config.crc_on = true;
		catsniffer.fsk_config.config_pending = true;
		shell_reply("FSK CRC enabled (pending)\r\n");
	} else if (strncmp(args, "off", 3) == 0) {
		catsniffer.fsk_config.crc_on = false;
		catsniffer.fsk_config.config_pending = true;
		shell_reply("FSK CRC disabled (pending)\r\n");
	} else {
		shell_reply("Error: Must be 'on' or 'off'\r\n");
	}
}

static void cmd_fsk_whitening(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_whitening <on|off>\r\n");
		return;
	}

	if (strncmp(args, "on", 2) == 0) {
		catsniffer.fsk_config.whitening = true;
		catsniffer.fsk_config.config_pending = true;
		shell_reply("FSK whitening enabled (pending)\r\n");
	} else if (strncmp(args, "off", 3) == 0) {
		catsniffer.fsk_config.whitening = false;
		catsniffer.fsk_config.config_pending = true;
		shell_reply("FSK whitening disabled (pending)\r\n");
	} else {
		shell_reply("Error: Must be 'on' or 'off'\r\n");
	}
}

static void cmd_fsk_pktlen(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_pktlen <fixed|variable>\r\n");
		return;
	}

	if (strncmp(args, "fixed", 5) == 0) {
		catsniffer.fsk_config.fixed_length = true;
		catsniffer.fsk_config.config_pending = true;
		shell_reply("FSK packet mode set to FIXED (pending)\r\n");
	} else if (strncmp(args, "variable", 8) == 0) {
		catsniffer.fsk_config.fixed_length = false;
		catsniffer.fsk_config.config_pending = true;
		shell_reply("FSK packet mode set to VARIABLE (pending)\r\n");
	} else {
		shell_reply("Error: Must be 'fixed' or 'variable'\r\n");
	}
}

