ElectronicCats/CatSniffer-Firmware/RP2040/catsniffer/src/shell_commands.c
static void cmd_fsk_payload(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_payload <1-255>\r\n");
		return;
	}

	int payload = atoi(args);
	if (payload < 1 || payload > 255) {
		shell_reply("Error: Payload length must be 1-255\r\n");
		return;
	}

	catsniffer.fsk_config.payload_len = (uint8_t)payload;
	catsniffer.fsk_config.config_pending = true;

	char buf[64];
	snprintf(buf, sizeof(buf), "FSK payload length set to %d (pending)\r\n",
		 payload);
	shell_reply(buf);
}

static void cmd_fsk_bt(char *args)
{
	uint8_t shaping;

	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: fsk_bt <off|0.3|0.5|0.7|1.0>\r\n");
		return;
	}

	if (strncmp(args, "off", 3) == 0) {
		shaping = FSK_BT_OFF;
	} else if (strncmp(args, "0.3", 3) == 0) {
		shaping = FSK_BT_03;
	} else if (strncmp(args, "0.5", 3) == 0) {
		shaping = FSK_BT_05;
	} else if (strncmp(args, "0.7", 3) == 0) {
		shaping = FSK_BT_07;
	} else if (strncmp(args, "1.0", 3) == 0 || strcmp(args, "1") == 0) {
		shaping = FSK_BT_10;
	} else {
		shell_reply("Error: Must be off, 0.3, 0.5, 0.7 or 1.0\r\n");
		return;
	}

	catsniffer.fsk_config.shaping = shaping;
	catsniffer.fsk_config.config_pending = true;
	shell_reply("FSK/GFSK BT shaping updated (pending)\r\n");
}

static void cmd_fsk_config(char *args)
{
	char buf[512];
	const char *pending_str =
		catsniffer.fsk_config.config_pending ? " (pending apply)" : "";
	const char *crc_str = catsniffer.fsk_config.crc_on ? "ON" : "OFF";
	const char *whitening_str = catsniffer.fsk_config.whitening ? "ON" :
								      "OFF";
	const char *pkt_mode_str =
		catsniffer.fsk_config.fixed_length ? "FIXED" : "VARIABLE";
	const char *bw_khz_str =
		fsk_bw_reg_to_khz_str(catsniffer.fsk_config.bandwidth);
	const char *bt_str;

	switch (catsniffer.fsk_config.shaping) {
	case FSK_BT_OFF:
		bt_str = "OFF";
		break;
	case FSK_BT_03:
		bt_str = "0.3";
		break;
	case FSK_BT_05:
		bt_str = "0.5";
		break;
	case FSK_BT_07:
		bt_str = "0.7";
		break;
	case FSK_BT_10:
		bt_str = "1.0";
		break;
	default:
		bt_str = "unknown";
		break;
	}

	/* Build sync word hex string */
	char sync_str[24] = { 0 };
	for (int i = 0; i < catsniffer.fsk_config.sync_word_len; i++) {
		char byte_str[4];
		snprintf(byte_str, sizeof(byte_str), "%02X",
			 catsniffer.fsk_config.sync_word[i]);
		strcat(sync_str, byte_str);
	}

	snprintf(buf, sizeof(buf),
		 "FSK/GFSK Configuration:%s\r\n"
		 "  Frequency: %u Hz\r\n"
		 "  Bitrate: %u bps\r\n"
		 "  Freq Deviation: %u Hz\r\n"
		 "  RX Bandwidth: 0x%02X (%s kHz)\r\n"
		 "  TX Power: %d dBm\r\n"
		 "  Gaussian BT: %s\r\n"
		 "  Preamble Length: %u bytes\r\n"
		 "  Sync Word: %s (%d bytes)\r\n"
		 "  Packet Mode: %s\r\n"
		 "  Payload Length: %u\r\n"
		 "  CRC: %s\r\n"
		 "  Whitening: %s\r\n"
		 "  Current Modulation: %s\r\n",
		 pending_str, catsniffer.fsk_config.frequency,
		 catsniffer.fsk_config.bitrate, catsniffer.fsk_config.fdev,
		 catsniffer.fsk_config.bandwidth, bw_khz_str,
		 catsniffer.fsk_config.tx_power, bt_str,
		 catsniffer.fsk_config.preamble_len, sync_str,
		 catsniffer.fsk_config.sync_word_len, pkt_mode_str,
		 catsniffer.fsk_config.payload_len, crc_str, whitening_str,
		 catsniffer.current_modulation == FSK_MOD_FSK ? "FSK" : "LoRa");
	shell_reply(buf);
}

static void cmd_fsk_apply(char *args)
{
	if (!catsniffer.fsk_config.config_pending) {
		shell_reply("No pending FSK configuration changes\r\n");
		return;
	}

	int ret = apply_fsk_config();
	if (ret < 0) {
		char buf[64];
		snprintf(buf, sizeof(buf),
			 "Error applying FSK configuration: %d\r\n", ret);
		shell_reply(buf);
	} else {
		catsniffer.fsk_config.config_pending = false;
		shell_reply("FSK configuration applied successfully\r\n");
	}
}

static void cmd_modulation(char *args)
{
	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		char buf[64];
		shell_reply("Usage: modulation <lora|fsk>\r\n");
		snprintf(buf, sizeof(buf), "  Current: %s\r\n",
			 catsniffer.current_modulation == FSK_MOD_FSK ? "FSK" :
									"LoRa");
		shell_reply(buf);
		return;
	}

	int ret;
	if (strncmp(args, "lora", 4) == 0) {
		ret = switch_to_lora();
		if (ret < 0) {
			shell_reply("Error switching to LoRa\r\n");
		} else {
			shell_reply("Switched to LoRa modulation\r\n");
		}
	} else if (strncmp(args, "fsk", 3) == 0) {
		ret = switch_to_fsk();
		if (ret < 0) {
			shell_reply("Error switching to FSK\r\n");
		} else {
			shell_reply("Switched to FSK modulation\r\n");
		}
	} else {
		shell_reply("Error: Must be 'lora' or 'fsk'\r\n");
	}
}

static void cmd_radio(char *args)
{
	char forwarded[128];
	int ret;

	while (*args && *args != ' ')
		args++;
	while (*args == ' ')
		args++;

	if (*args == '\0') {
		shell_reply("Usage: radio <TEST|FSKRX|FSKTEST|FSKTX HEX|TX "
			    "HEX>\r\n");
		return;
	}

	snprintf(forwarded, sizeof(forwarded), "%s", args);
	ret = queue_radio_command(forwarded);
	if (ret < 0) {
		shell_reply("ERROR: Failed to queue radio command\r\n");
	}
}

static void cmd_cc1352_jtag(char *args)
{
	char *subcmd;
	char buf[196];
	struct cc1352_jtag_status st;
	struct cc1352_jtag_diag dg;
	uint32_t jrc_id, cpu_id, dhcsr;
	int ret;

	while (*args && *args != ' ') {
		args++;
	}
	while (*args == ' ') {
		args++;
	}
	subcmd = args;
	while (*args && *args != ' ') {
		args++;
	}
	if (*args != '\0') {
		*args++ = '\0';
	}

	if (subcmd[0] == '\0') {
		shell_reply("Usage: cc1352_jtag <init|id|halt|status|diag>\r\n");
		return;
	}

	if (strcmp(subcmd, "init") == 0) {
		ret = cc1352_jtag_init_sequence();
		if (ret < 0) {
			snprintf(buf, sizeof(buf), "ERR init: %s (%d)\r\n",
				 cc1352_jtag_strerror(ret), ret);
			shell_reply(buf);
			return;
		}
		shell_reply("OK cc1352_jtag init complete\r\n");
		return;
	}

	if (strcmp(subcmd, "id") == 0) {
		ret = cc1352_jtag_read_idcodes(&jrc_id, &cpu_id);
		if (ret < 0) {
			snprintf(buf, sizeof(buf), "ERR id: %s (%d)\r\n",
				 cc1352_jtag_strerror(ret), ret);
			shell_reply(buf);
			return;
		}
		snprintf(buf, sizeof(buf),
			 "OK JRC IDCODE: 0x%08X, CPU DAP IDCODE: 0x%08X\r\n",
			 jrc_id, cpu_id);
		shell_reply(buf);
		return;
	}

	if (strcmp(subcmd, "halt") == 0) {
		ret = cc1352_jtag_halt_cpu(&dhcsr);
		if (ret < 0) {
			snprintf(buf, sizeof(buf), "ERR halt: %s (%d)\r\n",
				 cc1352_jtag_strerror(ret), ret);
			shell_reply(buf);
			return;
		}
		snprintf(buf, sizeof(buf), "OK CPU halted, DHCSR=0x%08X\r\n", dhcsr);
		shell_reply(buf);
		return;
	}

	if (strcmp(subcmd, "status") == 0) {
		cc1352_jtag_get_status(&st);
		snprintf(buf, sizeof(buf),
			 "JTAG status: pins=%d 4wire=%d cpu_tap=%d chain=%d taps=%d cpu_idx=%d jrc_idx=%d swap=%d rst_al=%d rst_src=%u rst_ctrl=%u rst_obs=%u pin_tck=%u pin_tms=%u pin_tdi=%u pin_tdo=%u\r\n",
			 st.pins_ready, st.switched_to_4wire, st.cpu_tap_enabled,
			 st.chain_detected, st.chain_taps, st.cpu_tap_index,
			 st.jrc_tap_index, st.data_pins_swapped, st.reset_active_low,
			 st.reset_source, st.reset_ctrl_level, st.reset_obs_level,
			 st.tck_pin, st.tms_pin, st.tdi_pin, st.tdo_pin);
		shell_reply(buf);
		snprintf(buf, sizeof(buf),
			 "  IDs: JRC=0x%08X CPU=0x%08X DHCSR=0x%08X\r\n",
			 st.jrc_idcode, st.cpu_idcode, st.last_dhcsr);
		shell_reply(buf);
		return;
	}

	if (strcmp(subcmd, "diag") == 0) {
		ret = cc1352_jtag_diag_probe(&dg);
		if (ret < 0) {
			snprintf(buf, sizeof(buf), "ERR diag: %s (%d)\r\n",
				 cc1352_jtag_strerror(ret), ret);
			shell_reply(buf);
			return;
		}

		snprintf(buf, sizeof(buf),
			 "diag map0(normal): direct=0x%08X switched=0x%08X tdo(pu/pd)=%u/%u\r\n",
			 dg.direct_jrc_id[0], dg.switched_jrc_id[0],
			 dg.tdo_pull_up_level[0], dg.tdo_pull_down_level[0]);
		shell_reply(buf);
		snprintf(buf, sizeof(buf),
			 "diag map1(swapped): direct=0x%08X switched=0x%08X tdo(pu/pd)=%u/%u\r\n",
			 dg.direct_jrc_id[1], dg.switched_jrc_id[1],
			 dg.tdo_pull_up_level[1], dg.tdo_pull_down_level[1]);
		shell_reply(buf);
		shell_reply(
			"Expected JRC ~= 0x1BB7702F (or masked 0x?BB7702F)\r\n");
		return;
	}

	shell_reply("Usage: cc1352_jtag <init|id|halt|status|diag>\r\n");
}

// Main command processor
void process_command(char *cmd, size_t len)
{
	if (len == 0)
		return;

	for (const shell_cmd_t *entry = commands; entry->name != NULL;
	     entry++) {
		if (entry->prefix_match) {
			size_t name_len = strlen(entry->name);
			if (strncmp(cmd, entry->name, name_len) == 0) {
				entry->handler(cmd);
				return;
			}
		} else {
			if (strcmp(cmd, entry->name) == 0) {
				entry->handler(cmd);
				return;
			}
		}
	}

	shell_reply("Unknown command. Type 'help'\r\n");
}
